{
  "sources": [
    {
      "title": "DenshiBlog",
      "feedUrl": "https://denshi.org/rss.xml",
      "siteUrl": "http://denshi.org/rss.xml",
      "articles": [
        {
          "id": "https://denshi.org/blog/archiving-some-older-videos.html",
          "author": null,
          "description": "Sometimes I take down videos from my channel. It's normally for a combination of reasons, but what it really waters down to is that I don't think those videos leave an accurate impression to new viewers. Here's a list of reasons I may want to take down a video:\nIt's incredibly poorly-made/There's some giant error\nIt doesn't fit the the general \"theme\" or tone of my channel\nIt seems backwards and harmful in hindsight\nEvery time I take down a video, I instantly upload it to my backup channel, DenshiBackup (YouTube link). This is because while I don't want to make my videos lost media! I'm sure that basically no one cares much for any of my videos, especially my older ones, but they have sentimental value to me (yes, even the garbage ones) so I keep them there for myself and anyone else who i…",
          "link": "https://denshi.org/blog/archiving-some-older-videos.html",
          "publishedOn": "2021-10-16T13:33:26.000Z",
          "wordCount": 977,
          "title": "Archiving some older videos"
        },
        {
          "id": "https://denshi.org/blog/some-selfhosting-updates.html",
          "author": null,
          "description": "I've been working the last few weeks on some additions to my self-hosting cabal of software; I'm happy to present these changes in today's post.\nXMPP Server!\nThis is old news, but I have an XMPP server! (denshi.org) I'm there and, in addition to having some public multi-user chats, these chats are bridged over to the Matrix and Discord thanks to Matterbridge. Here are the chats:\nGeneralic Chat, the classic, no-topic discussion channel,\nTech Support, an excellent (terrible) place to ask for help with computers,\nand finally, Bloated Meme Chat, where all the spiciest memes 🌶️ 🌶️ are posted.\nThe XMPP server is open to registrations, so if you've been meaning to try out XMPP, here's your chance to get an account through in-band registration. Just make sure to encrypt your messages, or I'll sp…",
          "link": "https://denshi.org/blog/some-selfhosting-updates.html",
          "publishedOn": "2021-10-12T16:01:10.000Z",
          "wordCount": 851,
          "title": "Some self-hosting updates"
        },
        {
          "id": "https://denshi.org/blog/guide-to-gcse-and-alevel.html",
          "author": null,
          "description": "Whenever I talk to my younger siblings and their friends about their future in school, I often see a lot of confusion regarding the current educational and examination systems. In this article, I will list and summarize the most common British qualifications, alongside some editorial paragraphs giving my opinion on each one.\n(I)GCSE\nLength: 2-3 years\nGrades: U-9 (U-A**)\nYears: 9-10/11\nSummary\nThe (International) General Certificate of Secondary Education is a qualification standard introduced in the UK in 1988. (The \"International\" GCSE is essentially the same system, but with some content cut for international audiences.) The (I)GCSE has a set of core subjects which are mandatory to complete; one of these is Humanities, for which you can pick between History or Geography. Alongside this, …",
          "link": "https://denshi.org/blog/guide-to-gcse-and-alevel.html",
          "publishedOn": "2021-10-03T12:53:27.000Z",
          "wordCount": 1123,
          "title": "Guide to GCSE and A-Level"
        },
        {
          "id": "https://denshi.org/blog/added-features-to-the-blog-system.html",
          "author": null,
          "description": "Recently, I've been tinkering around with Luke Smith's 'lb' script and adding various useful features.\nThe most useful one (which you will notice at the bottom of this entry) is the new (Reply-to) link at the end of all articles. This is appended automatically by the script everytime I publish a new article, and it works on RSS as well! This way, people have a convenient way of contacting me about any article; The link also sets the subject of your email to the title of my article, for extra comfiness.\nOne minor addition is that I fixed the links in the RSS feed. Now my articles link directly to their blog page counterparts, and not to the very unhelpful rolling blog page. I hope this makes reading my articles more convenient for all.\nI am considering getting rid of the rolling blog page in future, or maybe adding some extra features. If you have any suggestions, click the \"Reply-to\" link and send me an email with your ideas!\n(Reply-to)",
          "link": "https://denshi.org/blog/added-features-to-the-blog-system.html",
          "publishedOn": "2021-09-25T05:38:53.000Z",
          "wordCount": 187,
          "title": "Added features to the blog system"
        },
        {
          "id": "https://denshi.org/blog/music-production-on-linux.html",
          "author": null,
          "description": "For a very, very long time, musicians all over the world have employed the use of computers to aid them in music production. GNU/Linux, being the OS of choice for tinkerers and the technically inclined, gained a major following in the music and video production scene for it's speed, reliability and compatibility over the years. But what does music production on Linux actually look like?\nLMMS\nLMMS, also known as the Linux Multimedia Suite (or more commonly as \"Let's Make Music) is a Digital Audio Workstation (DAW) for Linux, Windows and MacOS. It's the single music production software I'm most experienced with, so I'm going to list some pros and cons:\nPros:\nIt's great for MIDI and sequencing.\nIt's compatible with most LADSPA plugins and supports WINE for Windows VSTs.\nIt has one of the most…",
          "link": "https://denshi.org/blog/music-production-on-linux.html",
          "publishedOn": "2021-09-24T17:24:12.000Z",
          "wordCount": 553,
          "title": "Music production on Linux"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}