{
  "sources": [
    {
      "title": "DenshiBlog",
      "feedUrl": "https://denshi.org/rss.xml",
      "siteUrl": "http://denshi.org/rss.xml",
      "articles": [
        {
          "id": "https://denshi.org/blog/updates-a-new-denshiwiki-with-l33t-earlyweb-gifs.html",
          "author": null,
          "description": "Well, here it is again!\nThe DenshiWiki has received a complete re-vamp, to make it easier to read, maintain and contribute to!\nFirstly, the backend I'm using is no longer MediaWiki. MediaWiki is the PHP/LEMP Stack software used by large wikis like Wikipedia and AE, and while it has lots of features and configurability, it's really suited more towards massive deployments, not a tiny wiki for some obscure YouTuber. The software I opted for is both minimalist and very configurable: Mycorrhiza!\nMycorrhiza is absolutely amazing\nMycorrhiza is truly a diamond in the rough when it comes to wiki software. So many wiki projects are outtdated or ridiculously bloated, while Mycorrhiza is just a simple backend written in Go with it's own basic systems for both git and web editing, and file uploads! The only inconvenience is that it uses it's own custom markup language named \"Mycomarkup\" which has features both from Markdown and the Mediawiki markup language. Mycormarkup is really easy to pick up and learn, but it took a while to convert each individual article from the old wiki to the new format.\nSections and subsections (\"Subhyphae\")\nMycorrhiza names any page on the wiki a Hypha (Plural: Hyphae). If a hyphae is created \"under\" another, as in Software/Linux, then the Linux hypha is a subhypha of the Software hypha.\nAll this means is that the wiki is now divided into sections which allows for much more organization.\nWant an account?\nOne final note: I've currently created a few users to maintain the wiki. If you want an account to edit the wiki, email me about it at alex@denshi.org\n(Reply-to)",
          "link": "https://denshi.org/blog/updates-a-new-denshiwiki-with-l33t-earlyweb-gifs.html",
          "publishedOn": "2021-12-16T16:30:32.000Z",
          "wordCount": 291,
          "title": "Updates: A new DenshiWiki! (With l33t early-web GIFs)"
        },
        {
          "id": "https://denshi.org/blog/updates-switching-to-codeberg-plans-for-future-videos.html",
          "author": null,
          "description": "I recently moved all of my repositories from my GitLab to a different git hosting site, Codeberg. I had known about the various existing git hosting sites, such as Sourcehut and various Cgit instances for a while, but I spent too long looking for a site that compromised common-sense privacy and anti-bloat defaults and popularity and usability, only to find Codeberg fits most of the requirements I needed.\nMy repos (as of now)\nI only have two important repositories on my Codeberg:\nSite\nThis is the repository where the source code to this website is stored. The reason I feel it really necessary to share this publically is so people can use my modified version of lb, which corrects the links in the RSS feed, gets rid of the rolling blog page and adds a \"reply-to\" link at the bottom of every article.\nDots\nThis is the repository where I store all my dotfiles. This includes some basic configs for some programs and my custom builds of dwm and st.\nOn my videos\nAs of recently, I've become more focused on making videos about Linux and technology. Despite this recent upturn in Linux videos, I want to make it perfectly clear that I continue to have no specific topic or direction to my channel. I want to make videos people like and want to watch; Whether they are pragmatically useful, like Linux/tech guides, or simply entertaining, doesn't change the fact that they're videos I want to make. So, just to make things clear, I will continue to make fun, well-edited and long videos from time to time.\n(Reply-to)",
          "link": "https://denshi.org/blog/updates-switching-to-codeberg-plans-for-future-videos.html",
          "publishedOn": "2021-12-03T15:40:20.000Z",
          "wordCount": 289,
          "title": "Updates: Switching to Codeberg, plans for future videos"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}